# running in reg_task1/src/
read -formal reg.v
prep -top eightbit_reg

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
